mmccoo/stm32_mmccoo/uart_spi_iic/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "dma.h"
#include "i2c.h"
#include "spi.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */

#include "OLED.h"
#include "u8g2.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
u8g2_t u8g2_iic;
u8g2_t u8g2_spi;
u8g2_t u8g2_nokia;

const uint32_t update_interval = 1000/60;

#define UNUSEDVAR __attribute__ ((unused))

#define test_width 16
#define test_height 7
 UNUSEDVAR static const uint8_t test_bits[] = {
   0x13, 0x00,
   0x15, 0x00,
   0x93, 0xcd,
   0x55, 0xa5,
   0x93, 0xc5,
   0x00, 0x80,
   0x00, 0x60
 };

#define xlogo64_width 64
#define xlogo64_height 64
UNUSEDVAR static unsigned char xlogo64_bits[] = {
   0xff, 0xff, 0x00, 0x00, 0x00, 0x00, 0x00, 0xf8, 0xfe, 0xff, 0x01, 0x00,
   0x00, 0x00, 0x00, 0xf8, 0xfc, 0xff, 0x03, 0x00, 0x00, 0x00, 0x00, 0x7c,
   0xf8, 0xff, 0x07, 0x00, 0x00, 0x00, 0x00, 0x3e, 0xf8, 0xff, 0x07, 0x00,
   0x00, 0x00, 0x00, 0x1f, 0xf0, 0xff, 0x0f, 0x00, 0x00, 0x00, 0x80, 0x0f,
   0xe0, 0xff, 0x1f, 0x00, 0x00, 0x00, 0x80, 0x0f, 0xc0, 0xff, 0x3f, 0x00,
   0x00, 0x00, 0xc0, 0x07, 0xc0, 0xff, 0x3f, 0x00, 0x00, 0x00, 0xe0, 0x03,
   0x80, 0xff, 0x7f, 0x00, 0x00, 0x00, 0xf0, 0x01, 0x00, 0xff, 0xff, 0x00,
   0x00, 0x00, 0xf8, 0x00, 0x00, 0xfe, 0xff, 0x01, 0x00, 0x00, 0xf8, 0x00,
   0x00, 0xfe, 0xff, 0x01, 0x00, 0x00, 0x7c, 0x00, 0x00, 0xfc, 0xff, 0x03,
   0x00, 0x00, 0x3e, 0x00, 0x00, 0xf8, 0xff, 0x07, 0x00, 0x00, 0x1f, 0x00,
   0x00, 0xf0, 0xff, 0x0f, 0x00, 0x80, 0x0f, 0x00, 0x00, 0xf0, 0xff, 0x0f,
   0x00, 0xc0, 0x07, 0x00, 0x00, 0xe0, 0xff, 0x1f, 0x00, 0xc0, 0x07, 0x00,
   0x00, 0xc0, 0xff, 0x3f, 0x00, 0xe0, 0x03, 0x00, 0x00, 0x80, 0xff, 0x7f,
   0x00, 0xf0, 0x01, 0x00, 0x00, 0x80, 0xff, 0x7f, 0x00, 0xf8, 0x00, 0x00,
   0x00, 0x00, 0xff, 0xff, 0x00, 0x7c, 0x00, 0x00, 0x00, 0x00, 0xfe, 0xff,
   0x01, 0x7c, 0x00, 0x00, 0x00, 0x00, 0xfc, 0xff, 0x03, 0x3e, 0x00, 0x00,
   0x00, 0x00, 0xfc, 0xff, 0x03, 0x1f, 0x00, 0x00, 0x00, 0x00, 0xf8, 0xff,
   0x87, 0x0f, 0x00, 0x00, 0x00, 0x00, 0xf0, 0xff, 0xcf, 0x07, 0x00, 0x00,
   0x00, 0x00, 0xe0, 0xff, 0xcf, 0x07, 0x00, 0x00, 0x00, 0x00, 0xe0, 0xff,
   0xe7, 0x03, 0x00, 0x00, 0x00, 0x00, 0xc0, 0xff, 0xf3, 0x01, 0x00, 0x00,
   0x00, 0x00, 0x80, 0xff, 0xf9, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xff,
   0xfc, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x7f, 0xfe, 0x00, 0x00, 0x00,
   0x00, 0x00, 0x00, 0x7e, 0xfe, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3e,
   0xff, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x9f, 0xff, 0x07, 0x00, 0x00,
   0x00, 0x00, 0x80, 0xcf, 0xff, 0x07, 0x00, 0x00, 0x00, 0x00, 0xc0, 0xe7,
   0xff, 0x0f, 0x00, 0x00, 0x00, 0x00, 0xc0, 0xe7, 0xff, 0x1f, 0x00, 0x00,
   0x00, 0x00, 0xe0, 0xc3, 0xff, 0x3f, 0x00, 0x00, 0x00, 0x00, 0xf0, 0xc1,
   0xff, 0x3f, 0x00, 0x00, 0x00, 0x00, 0xf8, 0x80, 0xff, 0x7f, 0x00, 0x00,
   0x00, 0x00, 0x7c, 0x00, 0xff, 0xff, 0x00, 0x00, 0x00, 0x00, 0x7c, 0x00,
   0xfe, 0xff, 0x01, 0x00, 0x00, 0x00, 0x3e, 0x00, 0xfe, 0xff, 0x01, 0x00,
   0x00, 0x00, 0x1f, 0x00, 0xfc, 0xff, 0x03, 0x00, 0x00, 0x80, 0x0f, 0x00,
   0xf8, 0xff, 0x07, 0x00, 0x00, 0xc0, 0x07, 0x00, 0xf0, 0xff, 0x0f, 0x00,
   0x00, 0xe0, 0x03, 0x00, 0xf0, 0xff, 0x0f, 0x00, 0x00, 0xe0, 0x03, 0x00,
   0xe0, 0xff, 0x1f, 0x00, 0x00, 0xf0, 0x01, 0x00, 0xc0, 0xff, 0x3f, 0x00,
   0x00, 0xf8, 0x00, 0x00, 0x80, 0xff, 0x7f, 0x00, 0x00, 0x7c, 0x00, 0x00,
   0x80, 0xff, 0x7f, 0x00, 0x00, 0x3e, 0x00, 0x00, 0x00, 0xff, 0xff, 0x00,
   0x00, 0x3e, 0x00, 0x00, 0x00, 0xfe, 0xff, 0x01, 0x00, 0x1f, 0x00, 0x00,
   0x00, 0xfc, 0xff, 0x03, 0x80, 0x0f, 0x00, 0x00, 0x00, 0xfc, 0xff, 0x03,
   0xc0, 0x07, 0x00, 0x00, 0x00, 0xf8, 0xff, 0x07, 0xe0, 0x03, 0x00, 0x00,
   0x00, 0xf0, 0xff, 0x0f, 0xe0, 0x03, 0x00, 0x00, 0x00, 0xe0, 0xff, 0x1f,
   0xf0, 0x01, 0x00, 0x00, 0x00, 0xe0, 0xff, 0x1f, 0xf8, 0x00, 0x00, 0x00,
   0x00, 0xc0, 0xff, 0x3f, 0x7c, 0x00, 0x00, 0x00, 0x00, 0x80, 0xff, 0x7f,
   0x3e, 0x00, 0x00, 0x00, 0x00, 0x00, 0xff, 0xff};


// convert lydia.jpg -crop 64x64 -monochrome -negate lydia.xbm
#define lydia_width 64
#define lydia_height 64
static unsigned char lydia_bits[] = {
  0xE0, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xF0, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0xDF, 0xFF, 0xF0, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 
  0xF8, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFC, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0xFF, 0xFF, 0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xDF, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0x7F, 0xAB, 0xFA, 0xF7, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xBA, 
  0xFF, 0xFD, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xDF, 0x6A, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0xFF, 0x2F, 0xF5, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFE, 0xF5, 
  0xF7, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xEB, 0xDE, 0xEA, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xD7, 0xAE, 0x37, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x5B, 0x7B, 0xB3, 
  0xF7, 0xFF, 0xFF, 0xFF, 0xFF, 0xA5, 0xDD, 0xDE, 0xFC, 0xFF, 0xFF, 0xFF, 
  0x7F, 0xDA, 0xFF, 0x4F, 0xFD, 0xFF, 0xFF, 0xFF, 0xFF, 0xA5, 0xFB, 0xBB, 
  0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xEA, 0xFF, 0x67, 0xFD, 0xFF, 0xFF, 0xFF, 
  0x7F, 0xD6, 0xFF, 0xBF, 0xFA, 0xFF, 0xFF, 0xFF, 0x3F, 0xF0, 0xFF, 0xBF, 
  0xFE, 0xFF, 0xFF, 0xFF, 0xBF, 0xEC, 0xFF, 0xDF, 0xF9, 0xFF, 0xFF, 0xFF, 
  0x7F, 0x18, 0xF9, 0x6B, 0xFA, 0xFF, 0xED, 0xFF, 0x7F, 0x40, 0xA6, 0xBF, 
  0xF6, 0xFF, 0xFF, 0xFF, 0x7F, 0x00, 0x96, 0x9B, 0xFB, 0xFF, 0xFF, 0xFF, 
  0x3F, 0x00, 0xFD, 0x5A, 0xFE, 0xFF, 0xFB, 0xFF, 0x3F, 0x00, 0xB4, 0xD5, 
  0xFE, 0x7F, 0xFA, 0xFF, 0x3F, 0x00, 0xD8, 0x1A, 0xFB, 0xFF, 0xFF, 0xFF, 
  0x7F, 0x00, 0x62, 0xC3, 0xFA, 0xFF, 0xFB, 0xFF, 0x7F, 0x00, 0x98, 0x00, 
  0xFD, 0xFF, 0xFA, 0xFF, 0x7F, 0x00, 0xA0, 0x04, 0xF4, 0x7F, 0x77, 0xFF, 
  0x3F, 0x00, 0x40, 0x23, 0xA0, 0xFF, 0xE9, 0xFF, 0x3F, 0x00, 0x98, 0x02, 
  0xCC, 0x7F, 0xFE, 0xFF, 0x3F, 0x00, 0x60, 0x05, 0xF0, 0xFF, 0xA5, 0xFF, 
  0x3F, 0x00, 0xC0, 0xC2, 0xEB, 0xBE, 0xE9, 0xFF, 0x7F, 0x00, 0x58, 0x81, 
  0xF0, 0xFF, 0xAE, 0xFF, 0x3F, 0x00, 0xF8, 0x01, 0xE0, 0x7F, 0xF5, 0xFF, 
  0x3F, 0x00, 0x22, 0x00, 0xF4, 0xFF, 0xAA, 0xFF, 0x7F, 0x00, 0x34, 0x40, 
  0xF4, 0xFF, 0xE5, 0xFF, 0x7F, 0x00, 0x5A, 0x00, 0xA9, 0xFB, 0xBB, 0xFF, 
  0x3F, 0x00, 0x24, 0x00, 0x64, 0xFF, 0xA7, 0xFF, 0x7F, 0x00, 0x5A, 0x00, 
  0xD9, 0xFF, 0xE5, 0xFF, 0xFF, 0x00, 0x1A, 0x00, 0xFA, 0xFF, 0x67, 0xFF, 
  0x7F, 0x80, 0xAD, 0xB6, 0xFA, 0xFF, 0xE7, 0xFF, 0xFF, 0x00, 0xF8, 0xA5, 
  0xED, 0xFA, 0xD7, 0xFF, 0x7F, 0x00, 0xFE, 0x01, 0xA8, 0xFF, 0xE7, 0xFF, 
  0xFF, 0x01, 0xDE, 0x03, 0x00, 0xFF, 0xE3, 0xFF, 0xFF, 0x01, 0xA8, 0x07, 
  0xC0, 0xFF, 0xDB, 0xFF, 0xFF, 0x03, 0x3E, 0x06, 0xFC, 0xFF, 0xF7, 0xFF, 
  0xFF, 0x03, 0x00, 0x20, 0xAA, 0xFF, 0xFF, 0xFF, 0xFF, 0x07, 0x0D, 0x80, 
  0xED, 0xFF, 0xF7, 0xFF, 0xFF, 0x8F, 0x00, 0x00, 0xF6, 0xFF, 0xF9, 0xFF, 
  0xFF, 0x1F, 0x00, 0xC0, 0xD5, 0xFF, 0xFF, 0xFF, 0xFF, 0x5F, 0x02, 0x00, 
  0xDA, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x6A, 0xFE, 0xFF, 0xFF, 
  0xFF, 0xFF, 0x01, 0x00, 0x95, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 
  0xEC, 0xF6, 0xFF, 0xFF, 0xFF, 0xFF, 0x1F, 0x00, 0x40, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0x0F, 0x00, 0xB0, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x3F, 0x00, 
  0x80, 0xFE, 0xFF, 0xFF, 0xFE, 0xFF, 0x7F, 0x00, 0xA8, 0xFF, 0xFF, 0xFF, 
  0xFF, 0xFF, 0xFF, 0x00, 0x90, 0xFF, 0xFF, 0xFF, };


/* USER CODE END PV */

