mmccoo/stm32_mmccoo/uart_spi_iic/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void delayLoop() {
        volatile uint32_t delayCount = 10000; // volatile, um "Wegoptimieren" zu vermeinden
                                               //(http://en.wikipedia.org/wiki/Volatile_variable)
        while (delayCount > 0) {
                delayCount--;
        }
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
  HAL_UART_StateTypeDef state = HAL_UART_GetState(huart);
  if (state == HAL_UART_STATE_READY) {

  } else {

  }
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  HAL_SPI_StateTypeDef state = HAL_SPI_GetState(hspi);
  if (state == HAL_SPI_STATE_READY) {

  } else {

  }
  
}

void byte_at_string(uint8_t *str, int i)
{
  
  str[2] = '0' + i%10;
  str[1] = '0' + (i/10)%10;
  str[0] = '0' + (i/100)%10;
  
}
void btoa(uint8_t i, uint8_t *str)
{  
  str[2] = '0' + i%10;
  str[1] = '0' + (i/10)%10;
  str[0] = '0' + (i/100)%10; 
}

void itoa(uint32_t i, uint8_t *str)
{  
  str[4] = '0' + i%10;
  str[3] = '0' + (i/10)%10;
  str[2] = '0' + (i/100)%10;
  str[1] = '0' + (i/1000)%10;
  str[0] = '0' + (i/10000)%10; 
}


void hex_at_string(uint8_t *str, int i)
{
  uint8_t lower = i&0xF;
  uint8_t upper = (i&0xF0) >> 4;

  if (lower < 10) {
    str[1] = '0' + lower;
  } else {
    str[1] = 'A' + lower - 10;    
  }
  if (upper < 10) {
    str[0] = '0' + upper;
  } else {
    str[0] = 'A' + upper - 10;    
  }  
}


int my_I2C_GET_FLAG(I2C_HandleTypeDef* __HANDLE__,
                    uint32_t __FLAG__)
{
  // #define I2C_FLAG_BUSY                   ((uint32_t)0x0010 0002)
  // #define I2C_FLAG_MASK                   ((uint32_t)0x0000 FFFF)
  if (((uint8_t)((__FLAG__) >> 16)) == 0x01) {
    return (__HANDLE__->Instance->SR1 & __FLAG__ & I2C_FLAG_MASK) == (__FLAG__ & I2C_FLAG_MASK);
  } else {
    return (__HANDLE__->Instance->SR2 & __FLAG__ & I2C_FLAG_MASK) == (__FLAG__ & I2C_FLAG_MASK);
  }
}

void sendUARTmsgPoll(uint8_t *msg, uint16_t length) {
  while (HAL_UART_GetState(&huart1) != HAL_UART_STATE_READY) {/*empty*/}
  HAL_UART_Transmit(&huart1, msg, length, HAL_MAX_DELAY);

}


uint32_t amountsent =0;
//extern "C"

uint8_t
u8x8_byte_my_hw_i2c(
  U8X8_UNUSED u8x8_t *u8x8,
  U8X8_UNUSED uint8_t msg,
  U8X8_UNUSED uint8_t arg_int,
  U8X8_UNUSED void *arg_ptr)
{
#define MAX_LEN 32
  static uint8_t vals[MAX_LEN];
  static uint8_t length=0;
  
  U8X8_UNUSED uint8_t *args = arg_ptr;
  switch(msg)  {
  case U8X8_MSG_BYTE_SEND: {
    if ((arg_int+length) <= MAX_LEN) {
      for(int i=0; i<arg_int; i++) {
        vals[length] = args[i];
        length++;
      }
    } else {
      uint8_t umsg[] = "MSG_BYTE_SEND arg too long xxx\n";
      byte_at_string(umsg+27, arg_int);
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }
    uint8_t umsg[] = "MSG_BYTE_SEND 0xxx\n";
    // 00 AE = display off
    // 00 D5 = set display clock
    // 00 80    divide ratio
    // 00 A8 = set multiplex ratio
    // 00 3F    64 mux
    // 00 D3 = set display offset
    // 00 00
    // 00 40 - 00 7F set display start line
    
    
    hex_at_string(umsg+16, args[0]);
    //sendUARTmsgPoll(umsg, sizeof(umsg));
    break;
  }
  case U8X8_MSG_BYTE_INIT: {
    uint8_t umsg[] = "MSG_BYTE_INIT xxx\n";
    byte_at_string(umsg+14, arg_int);
    //sendUARTmsgPoll(umsg, sizeof(umsg));
    break;
  }
  case U8X8_MSG_BYTE_SET_DC: {
    uint8_t umsg[] = "MSG_BYTE_SET_DC xxx\n";
    byte_at_string(umsg+15, arg_int);
    sendUARTmsgPoll(umsg, sizeof(umsg));
    break;
  }
  case U8X8_MSG_BYTE_START_TRANSFER: {
    UNUSEDVAR uint8_t umsg[] = "MSG_BYTE_START\n";
    //sendUARTmsgPoll(umsg, sizeof(umsg));
    length = 0;
    break;
  }
  case U8X8_MSG_BYTE_END_TRANSFER: {
    UNUSEDVAR uint8_t umsg[] = "MSG_BYTE_END xxxxx\n";
    itoa(length, umsg+13);
    //sendUARTmsgPoll(umsg, sizeof(umsg));
    while(HAL_I2C_GetState (&hi2c1) != HAL_I2C_STATE_READY) { /* empty */ }
    const uint8_t addr = 0x78;
    HAL_I2C_Master_Transmit(&hi2c1, addr, vals, length, 10);
    amountsent+= length;
    break;
  }
  default: {
    uint8_t umsg[] = "MSG_BYTE_DEFAULT xxx\n";
    byte_at_string(umsg+17, arg_int);
    //sendUARTmsgPoll(umsg, sizeof(umsg));
    return 0;
  }
  }
  return 1;
}


// a typical sequence for init display
// U8X8_MSG_BYTE_INIT


uint8_t
u8x8_byte_my_hw_spi(
  U8X8_UNUSED u8x8_t *u8x8,
  U8X8_UNUSED uint8_t msg,
  U8X8_UNUSED uint8_t arg_int,
  U8X8_UNUSED void *arg_ptr,
  GPIO_TypeDef *CSPORT,
  uint32_t      CSSET,
  uint32_t      CSRESET
  )
{
  const uint8_t senduart = 0;
  
  U8X8_UNUSED uint8_t *args = arg_ptr;
  switch(msg)  {
  case U8X8_MSG_BYTE_SEND: {
    while(HAL_SPI_GetState (&hspi1) != HAL_SPI_STATE_READY) { /* empty */ }
    HAL_SPI_Transmit (&hspi1, arg_ptr, arg_int, HAL_MAX_DELAY);
    amountsent+= arg_int;

    if (senduart) {
      uint8_t umsg[] = "MSG_BYTE_SEND xxx\n";
      byte_at_string(umsg+14, arg_int);
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }
    if (senduart) {
      uint8_t umsg[] = "MSG_BYTE_SEND 0xxx\n";
      // 00 AE = display off
      // 00 D5 = set display clock
      // 00 80    divide ratio
      // 00 A8 = set multiplex ratio
      // 00 3F    64 mux
      // 00 D3 = set display offset
      // 00 00
      // 00 40 - 00 7F set display start line
      hex_at_string(umsg+16, args[0]);
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }

    break;
  }
  case U8X8_MSG_BYTE_INIT: {
    if (senduart) {
      uint8_t umsg[] = "MSG_BYTE_INIT xxx\n";
      byte_at_string(umsg+14, arg_int);
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }
    break;
  }
  case U8X8_MSG_BYTE_SET_DC: {
    if (arg_int) {
      GPIOA->BSRR = GPIO_BSRR_BS4;
    } else {
      GPIOA->BSRR = GPIO_BSRR_BR4;
    }
    if (senduart) {
      uint8_t umsg[] = "MSG_BYTE_SET_DC xxx\n";
      byte_at_string(umsg+16, arg_int);
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }
    break;
  }
  case U8X8_MSG_BYTE_START_TRANSFER: {
    CSPORT->BSRR = CSRESET;

