mmccoo/stm32_mmccoo/uart_spi_iic/Src/main.c
    if (senduart) {
      UNUSEDVAR uint8_t umsg[] = "MSG_BYTE_START\n";
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }
    break;
  }
  case U8X8_MSG_BYTE_END_TRANSFER: {
    CSPORT->BSRR = CSSET;
    if (senduart) {
      UNUSEDVAR uint8_t umsg[] = "MSG_BYTE_END\n";
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }
    break;
  }
  default: {
    if (senduart) {
      uint8_t umsg[] = "MSG_BYTE_DEFAULT xxx\n";
      byte_at_string(umsg+17, arg_int);
      sendUARTmsgPoll(umsg, sizeof(umsg));
    }
    return 0;
  }
  }
  return 1;
}


uint8_t
u8x8_byte_my_hw_spi_oled(
  U8X8_UNUSED u8x8_t *u8x8,
  U8X8_UNUSED uint8_t msg,
  U8X8_UNUSED uint8_t arg_int,
  U8X8_UNUSED void *arg_ptr)
{
  return u8x8_byte_my_hw_spi(u8x8, msg, arg_int, arg_ptr,
                             OLED_CS_GPIO_Port, GPIO_BSRR_BS3, GPIO_BSRR_BR3);
}
uint8_t
u8x8_byte_my_hw_spi_nokia(
  U8X8_UNUSED u8x8_t *u8x8,
  U8X8_UNUSED uint8_t msg,
  U8X8_UNUSED uint8_t arg_int,
  U8X8_UNUSED void *arg_ptr)
{
  return u8x8_byte_my_hw_spi(u8x8, msg, arg_int, arg_ptr,
                             NOK_CS_GPIO_Port, GPIO_BSRR_BS1, GPIO_BSRR_BR1);
}


uint8_t u8x8_gpio_and_delay_mine(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr)
{
  UNUSEDVAR uint8_t umsg[] = "calling gpio and delay\n";
  //sendUARTmsgPoll(umsg, sizeof(umsg));
  
  switch(msg)
  {
    case U8X8_MSG_GPIO_AND_DELAY_INIT:
      /* only support for software I2C*/
    
     
      break;
    case U8X8_MSG_DELAY_NANO:
      /* not required for SW I2C */
      break;
    
    case U8X8_MSG_DELAY_10MICRO:
      /* not used at the moment */
      break;
    
    case U8X8_MSG_DELAY_100NANO:
      /* not used at the moment */
      break;
   
    case U8X8_MSG_DELAY_MILLI:
      //delay_micro_seconds(arg_int*1000UL);
      break;
    case U8X8_MSG_DELAY_I2C:
      /* arg_int is 1 or 4: 100KHz (5us) or 400KHz (1.25us) */
      //delay_micro_seconds(arg_int<=2?5:1);
      break;
    
    case U8X8_MSG_GPIO_I2C_CLOCK:
      
      break;
    case U8X8_MSG_GPIO_I2C_DATA:
      
      break;
/*
    case U8X8_MSG_GPIO_MENU_SELECT:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_SELECT_PORT, KEY_SELECT_PIN));
      break;
    case U8X8_MSG_GPIO_MENU_NEXT:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_NEXT_PORT, KEY_NEXT_PIN));
      break;
    case U8X8_MSG_GPIO_MENU_PREV:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_PREV_PORT, KEY_PREV_PIN));
      break;
    
    case U8X8_MSG_GPIO_MENU_HOME:
      u8x8_SetGPIOResult(u8x8, Chip_GPIO_GetPinState(LPC_GPIO, KEY_HOME_PORT, KEY_HOME_PIN));
      break;
*/
    default:
      //u8x8_SetGPIOResult(u8x8, 1);
      break;
  }
  return 1;
}

void HAL_SYSTICK_Callback(void)
{
  static uint8_t ledon = 1;
  if ((HAL_GetTick() % 1000) == 0) {
    if (ledon) {
      GPIOC->ODR |= GPIO_PIN_13;
    } else {
      GPIOC->ODR &= ~(GPIO_PIN_13);
    }
    ledon = !ledon;
  }
}

typedef enum {
  HI_WORLD,
  LYDIA_PIC,
  STOCK_U8G2,
  TIMECODE,
  LAST_IMG 
} IMGS;

// strlen is: for each of sec,min,hour=6 and two :s=8 total
void tick_to_time(uint32_t curtime, char str[8])
{

  uint8_t seconds = curtime/1000 % 60;
  str[7] = '0' + (seconds % 10); 
  str[6] = '0' + (seconds / 10);

  str[5] = ':';
  
  uint8_t minutes = (curtime/1000 / 60) % 60;
  str[4] = '0' + (minutes % 10);
  str[3] = '0' + (minutes / 10);

  str[2] = ':';
  
  uint8_t hours = (curtime/1000 / 60 / 60);
  str[1] = '0' + (hours % 10);
  str[0] = '0' + (hours / 10);

}

void Refresh_OLED(u8g2_t *u8g2, IMGS img)
{
  u8g2_ClearBuffer(u8g2);
  uint32_t curtime = HAL_GetTick();

  while(HAL_SPI_GetState (&hspi1) != HAL_SPI_STATE_READY) { /* empty */ }

  
  int pagenum = 0;
  u8g2_FirstPage(u8g2);
  do {
    pagenum++;

    //u8g2_SetContrast(u8g2, 255);
    switch (img) {
    case HI_WORLD:
      u8g2_SetFont(u8g2, u8g2_font_ncenB14_tr);
      u8g2_DrawStr(u8g2, 0,24,"Hi World!");
      break;

    case LYDIA_PIC:
      //u8g2_DrawBox(u8g2, 10,20, 20, 30);
      u8g2_SetFont(u8g2, u8g2_font_ncenB14_tr);
      //u8g2_DrawStr(u8g2, 0,15,"This World!");
      //u8g2_DrawStr(u8g2, 0,30,"Other World!");
      //u8g2_DrawXBM(u8g2, 0, 20, LOGO16_GLCD_WIDTH, LOGO16_GLCD_HEIGHT, logo16_glcd_bmp);

      // set color to zero. the bitmap I have would otherwise be negative.
      u8g2_SetDrawColor(u8g2, 0);
      u8g2_DrawXBM(u8g2, 0, 0, lydia_width, lydia_height, lydia_bits);
      u8g2_DrawXBM(u8g2, 64, 0, xlogo64_width, xlogo64_height, xlogo64_bits);
      break;

    case STOCK_U8G2:
      u8g2_SetDrawColor(u8g2, 1);
      u8g2_SetFontMode(u8g2, 1);	// Transparent
      u8g2_SetFontDirection(u8g2, 0);
      u8g2_SetFont(u8g2, u8g2_font_inb24_mf);
      u8g2_DrawStr(u8g2, 0, 30, "U");
    
      u8g2_SetFontDirection(u8g2, 1);
      u8g2_SetFont(u8g2, u8g2_font_inb30_mn);
      u8g2_DrawStr(u8g2, 21,8,"8");
        
      u8g2_SetFontDirection(u8g2, 0);
      u8g2_SetFont(u8g2, u8g2_font_inb24_mf);
      u8g2_DrawStr(u8g2, 51,30,"g");
      u8g2_DrawStr(u8g2, 67,30,"\xb2");
    
      u8g2_DrawHLine(u8g2, 2, 35, 47);
      u8g2_DrawHLine(u8g2, 3, 36, 47);
      u8g2_DrawVLine(u8g2, 45, 32, 12);
      u8g2_DrawVLine(u8g2, 46, 33, 12);
  
      u8g2_SetFont(u8g2, u8g2_font_4x6_tr);
      u8g2_DrawStr(u8g2, 1,54,"github.com/olikraus/u8g2");
      break;

    case TIMECODE: {
      int y = 12;
      u8g2_SetDrawColor(u8g2, 1);
      u8g2_SetFontMode(u8g2, 1);	// Transparent
      u8g2_SetFontDirection(u8g2, 0);
      u8g2_SetFont(u8g2, u8g2_font_9x15_mn);
      char time[8];
      tick_to_time(curtime, time);
      u8g2_DrawStr(u8g2, 0, y, time);

      const int fract_x = 7;
      const int fract_y = 4;      
      y+= fract_y;
      
      int fractional = (curtime % 1000) * 66 / 1000;
      int x = (fractional%10)*fract_x;
      y+= fractional/10*fract_y;
      u8g2_DrawBox(u8g2, x, y, fract_x, fract_y);
      
      break;
    }
    default:
      break;

    }
  
    //NextPage calls SendBuffer
    u8g2_SendBuffer(u8g2);

    // when drawing the time, lets just do the first two pages
    if (img==TIMECODE && pagenum>=2) {
      return;
    }
  } while ( u8g2_NextPage(u8g2) );

