mmccoo/stm32_mmccoo/uart_spi_iic/Src/main.c
}

typedef enum {
  DIGIT_0 = 0x1,
  DIGIT_1 = 0x2,
  DIGIT_2 = 0x3,
  DIGIT_3 = 0x4,
  DIGIT_4 = 0x5,
  DIGIT_5 = 0x6,
  DIGIT_6 = 0x7,
  DIGIT_7 = 0x8,

  DECODE_MODE = 0x9,
  INTENSITY   = 0xA,
  SCAN_LIMIT  = 0xB,
  SHUTDOWN    = 0xC,
  DISPLAY_TEST= 0xF    
} MAX7219_COMMAND;


static inline
void
send_max7219_value(MAX7219_COMMAND cmd, uint8_t value)
{
  /* The data is then latched into either the digit or control
     registers on the rising edge of LOAD/CS. LOAD/CS must go high
     concurrently with or after the 16th rising clock edge, but before
     the next rising clock edge or data will be lost. */

  // with the BSRR registers, the lower 16 bits are set bits, the upper
  // 16 are reset.
  // reset CS pin
  SEVEN_CS_GPIO_Port->BSRR = SEVEN_CS_Pin << 16;

  // for the command (upper bits), then the value.
  uint8_t command[2] = { cmd, value };
  
  while(HAL_SPI_GetState (&hspi1) != HAL_SPI_STATE_READY) { /* empty */ }
  HAL_SPI_Transmit (&hspi1, command, sizeof(command), HAL_MAX_DELAY);
  // set CS pin, causing a rising edge.
  SEVEN_CS_GPIO_Port->BSRR = SEVEN_CS_Pin;

  // Before the hardware reminded me that I need a CS edge for every command,
  // I initially wrote this function to return a uint16. I then wanted to send
  // all the bits a once. Being used to programming PCs on Intel architecture
  // I got a lesson in endianness. With Intel, little endian, casting values
  // works fine. in big endian, the bytes need to move around.
  // Since I don't think this affected me before, I'm leaving these comment in.
  // although we are sending 16 bit register values, the transmit
  // function looks at 8 bit vales.
  // since we're return a 16 bit value to a big endian system, the values
  // need to be swapped.
  // return (value << 8) | (cmd & 0xFF);
}

void
seven_segment_init()
{

  /* Data bits are labeled D0–D15 (Table 1). D8–D11 contain the register
     address. D0–D7 contain the data, and D12–D15 are “don’t care”
     bits. The first received is D15, the most significant bit (MSB). */

  /* D15-D12       D11-D8   D7-D0
     Don't care    Address  MSB Data LSB */

  /* Power up
     On initial power-up, all control registers are reset, the display
     is blanked, and the MAX7219/MAX7221 enter shutdown mode. Program the
     display driver prior to display use. Otherwise, it will initially be
     set to scan one digit, it will not decode data in the data registers,
     and the intensity register will be set to its minimum value.
  */

  /* Decode mode
     The decode-mode register sets BCD code B (0-9, E, H, L, P, and -)
     or no-decode operation for each digit. Each bit in the register
     corresponds to one digit. A logic high selects code B decoding
     while logic low bypasses the decoder.

     When the code B decode mode is used, the decoder looks only at
     the lower nibble of the data in the digit registers (D3–D0),
     disregarding bits D4–D6. D7, which sets the decimal point (SEG
     DP), is independent of the decoder and is positive logic (D7 = 1
     turns the decimal point on).

     In decode mode, the values 0-9 will display 0-9.
     the values 10-15 correspond to -,E,H,L,P,<blank>
  */

  // turn on decode mode for all 8.
  send_max7219_value(DECODE_MODE, 0xFF);

  /* intensity control
     Digital control of display brightness is provided by an internal
     pulse-width modulator, which is controlled by the lower nibble of
     the intensity register. The modulator scales the average segment
     current in 16 steps from a maximum of 31/32 down to 1/32 of the
     peak current set by RS

     for MAX7219
     data value 0x0 corresponds to 1/32 on. 
     intensity goes up in 2/32 increments.
     up to 1/32+ 15*2/32 = 31/32 @ value 0xF
  */

  // set intensity to full
  send_max7219_value(INTENSITY, 0x7);

  /* scan-limit register
     not doing anything interesting with this register.
     setting it to scan all digits.
     format is:
     value 0 -> only scan digit 0
     value N -> only scan digit 0-N
     value 7 -> scan all.
  */
  send_max7219_value(SCAN_LIMIT, 0x7);

  /* display-test register
     value 0 - normal operation
     value 1 - display test mode
   */
  send_max7219_value(DISPLAY_TEST, 0x0);

  /* no-op register
     The no-op register is used when cascading MAX7219s or
     MAX7221s. Connect all devices’ LOAD/CS inputs together and
     connect DOUT to DIN on adjacent devices.

     For example, if four MAX7219s are cascaded, then to write to the
     fourth chip, sent the desired 16-bit word, followed by three
     no-op codes (hex 0xXX0X, see Table 2). When LOAD/CS goes high,
     data is latched in all devices. The first three chips receive
     no-op commands, and the fourth receives the intended data.
  */
  
  
  /* shutdown
     When the MAX7219 is in shutdown mode, the scan oscil-lator is
     halted, all segment current sources are pulled to ground, and
     all digit drivers are pulled to V+, thereby blanking the
     display.
     Data in the digit and control registers remains
     unaltered. Shutdown can be used to save power or as an alarm to
     flash the display by successively entering and leaving shutdown
     mode.
     Typically, it takes less than 250μs for the MAX7219/ MAX7221 to
     leave shutdown mode. The display driver can be programmed while
     in shutdown mode, and shutdown mode can be overridden by the
     display-test function.

     Shutdown mode -    data = 0
     normal operation - data = 1
  */
  send_max7219_value(SHUTDOWN, 0x1);


 
}

void
seven_segment_display(uint8_t values[8])
{
  for(int i=0; i<8; i++) {
    if ((i==2) || (i==4) || (i==6)) {
      // position 7 is the decimal point.
      send_max7219_value(DIGIT_0+i, values[i] | (1<<7));
    } else {
      send_max7219_value(DIGIT_0+i, values[i]);
    }
  }  
}

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

