mmccoo/stm32_mmccoo/uart_spi_iic/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_SPI1_Init();
  MX_I2C1_Init();

  /* USER CODE BEGIN 2 */
  UNUSEDVAR uint8_t themessage[] = "E.T. is phoning home. Anyone there? Be sure to check spi\n";
  UNUSEDVAR uint8_t theothermessage[] = "Hey. I hate to interrupt, but...\n";
  UNUSEDVAR uint8_t spimessage[] = "This is a secret side message over spi\n";
  UNUSEDVAR uint8_t elapsedmessage[] = "time elapsed to draw xxx xxxxx xxx\n";
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  UNUSEDVAR uint8_t uart_poll = 1;
  UNUSEDVAR uint8_t spi_poll = 1;
  //uint8_t text_size = 0;
  uint8_t phase = 0;

  uint8_t seven_seg_values[8] = { 0, 1, 2, 3,
                                  4, 5, 6, 7 };
  seven_segment_init();
  seven_segment_display(seven_seg_values);
  
  u8g2_Setup_ssd1306_i2c_128x64_noname_1(&u8g2_iic,
                                         U8G2_R0,
                                         u8x8_byte_my_hw_i2c,
                                         u8x8_gpio_and_delay_mine);
  u8g2_InitDisplay(&u8g2_iic); // send init sequence to the display, display is in sleep mode after this,
  u8g2_SetPowerSave(&u8g2_iic, 0); // wake up display


  // reset the spi oled
  GPIOA->BSRR = GPIO_BSRR_BR2;
  delayLoop();
  GPIOA->BSRR = GPIO_BSRR_BS2;
  
  u8g2_Setup_ssd1306_128x64_noname_f(&u8g2_spi,
                                         U8G2_R0,
                                         u8x8_byte_my_hw_spi_oled,
                                         u8x8_gpio_and_delay_mine);
  
  u8g2_InitDisplay(&u8g2_spi); // send init sequence to the display, display is in sleep mode after this,
  u8g2_SetPowerSave(&u8g2_spi, 0); // wake up display

  u8g2_Setup_pcd8544_84x48_f(&u8g2_nokia,
                             U8G2_R0,
                             u8x8_byte_my_hw_spi_nokia,
                             u8x8_gpio_and_delay_mine);
  u8g2_InitDisplay(&u8g2_nokia); // send init sequence to the display, display is in sleep mode after this,
  u8g2_SetPowerSave(&u8g2_nokia, 0); // wake up display

  
  { uint8_t umsg[] = "done with init\n"; sendUARTmsgPoll(umsg, sizeof(umsg)); }


  UNUSEDVAR uint32_t myfreq = HAL_RCC_GetSysClockFreq();
  UNUSEDVAR uint32_t mysize = * (uint32_t*) FLASHSIZE_BASE;
  UNUSEDVAR uint32_t myid   = * (uint32_t*) UID_BASE;
  
  uint32_t last_update = 0;
  //InitOled();
  //OLED_Fill(0);
  uint8_t lasttime = 0;
  uint8_t do_oled_nok = 1;
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
    // p HAL_I2C_GetState (&hi2c1)
    // p __HAL_I2C_GET_FLAG(&hi2c1, I2C_FLAG_BUSY)

    uint32_t curtime = HAL_GetTick();

    //OLED_ShowStr(0,3, (unsigned char*) "HelTec Automation", (text_size++ % 2));


    if (curtime >= (last_update+update_interval)) {
      last_update = curtime;
      
      if (do_oled_nok) {
        Refresh_OLED(&u8g2_spi, phase);
        Refresh_OLED(&u8g2_iic, phase);
        Refresh_OLED(&u8g2_nokia, TIMECODE);
        phase = (phase+1)%4;
      }

      uint8_t values[8];
      // decimal seconds
      //values[0] = (curtime/10) % 10;  // milliseconds/10 is hundredth
      //values[1] = (curtime/100) % 10; // milliseconds/100 is tenths.
      int fractional = (curtime % 1000) * 66 / 1000;
      values[0] = fractional % 10; // milliseconds/10 is hundredth
      values[1] = fractional / 10; // milliseconds/100 is tenths.

      uint8_t seconds = curtime/1000 % 60;
      values[2] = seconds % 10; 
      values[3] = seconds / 10;

      uint8_t minutes = (curtime/1000 / 60) % 60;
      values[4] = minutes % 10;
      values[5] = minutes / 10;

      uint8_t hours = (curtime/1000 / 60 / 60);
      values[6] = hours % 10;
      values[7] = hours / 10;

      seven_segment_display(values);
    }
    
    UNUSEDVAR uint32_t finaltime = HAL_GetTick();
    UNUSEDVAR uint32_t elapsed =  finaltime-curtime;
    if (HAL_UART_GetState(&huart1) == HAL_UART_STATE_READY) {
      btoa(elapsed, elapsedmessage+21);
      itoa(amountsent,  elapsedmessage+25);
      HAL_UART_Transmit_IT(&huart1, elapsedmessage, sizeof(elapsedmessage));
    };
    
    if (((curtime % 1000) != 0) || (curtime == lasttime)) {
      continue;
    }
    lasttime = curtime;
    
    HAL_I2C_StateTypeDef iicstate =  HAL_I2C_GetState (&hi2c1);
    HAL_UART_StateTypeDef uartstate = HAL_UART_GetState(&huart1);
    if ((iicstate  == HAL_I2C_STATE_READY) &&
        (uartstate == HAL_UART_STATE_READY)) {
#if 0
      // this is basically a I2C address scanner.
      // I used it to verify that oled is at 120 and 121.
      // the actual addresses are half that and the second is simply the other
      // of read/write.
      
      uint8_t ii2messagealive[] = "I2C channel xxx is alive\n";
      uint8_t ii2messagedead[]  = "I2C channel xxx is dead\n";

      for(uint8_t i=0; i<128; i++) {
        uint8_t pData[] = "hello";
        HAL_StatusTypeDef iicstatus UNUSEDVAR;
        iicstatus = HAL_I2C_Master_Transmit(&hi2c1, i, pData, sizeof(pData), 10);
        if (iicstatus == HAL_OK) {
          byte_at_string(ii2messagealive+12, i);
          HAL_UART_Transmit(&huart1, ii2messagealive, sizeof(ii2messagealive), HAL_MAX_DELAY);
        } else {
          byte_at_string(ii2messagedead+12, i);
          HAL_UART_Transmit(&huart1, ii2messagedead, sizeof(ii2messagedead), HAL_MAX_DELAY);
        }
      }
#endif
            
    }

    
#if 0
    if (uartstate == HAL_UART_STATE_READY) {
      HAL_StatusTypeDef tstate UNUSEDVAR;
      if (uart_poll) {
        //tstate = HAL_UART_Transmit(&huart1, themessage, sizeof(themessage), HAL_MAX_DELAY);
        sendUARTmsgPoll(themessage, sizeof(themessage));
      } else {
        tstate = HAL_UART_Transmit_IT(&huart1, theothermessage, sizeof(theothermessage));     
      }
      uart_poll = !uart_poll;
      uartstate = HAL_UART_GetState(&huart1);
    }
#endif

